ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
/**
 ******************************************************************************
 * @file    stm32f4xx_tim.c
 * @author  MCD Application Team
 * @version V1.0.2
 * @date    05-March-2012
 * @brief   This file provides firmware functions to manage the following 
 *          functionalities of the TIM peripheral:
 *            - TimeBase management
 *            - Output Compare management
 *            - Input Capture management
 *            - Advanced-control timers (TIM1 and TIM8) specific features  
 *            - Interrupts, DMA and flags management
 *            - Clocks management
 *            - Synchronization management
 *            - Specific interface management
 *            - Specific remapping management      
 *              
 *  @verbatim
 *  
 *          ===================================================================
 *                                 How to use this driver
 *          ===================================================================
 *          This driver provides functions to configure and program the TIM 
 *          of all STM32F4xx devices.
 *          These functions are split in 9 groups: 
 *   
 *          1. TIM TimeBase management: this group includes all needed functions 
 *             to configure the TM Timebase unit:
 *                   - Set/Get Prescaler
 *                   - Set/Get Autoreload  
 *                   - Counter modes configuration
 *                   - Set Clock division  
 *                   - Select the One Pulse mode
 *                   - Update Request Configuration
 *                   - Update Disable Configuration
 *                   - Auto-Preload Configuration 
 *                   - Enable/Disable the counter     
 *                 
 *          2. TIM Output Compare management: this group includes all needed 
 *             functions to configure the Capture/Compare unit used in Output 
 *             compare mode: 
 *                   - Configure each channel, independently, in Output Compare mode
 *                   - Select the output compare modes
 *                   - Select the Polarities of each channel
 *                   - Set/Get the Capture/Compare register values
 *                   - Select the Output Compare Fast mode 
 *                   - Select the Output Compare Forced mode  
 *                   - Output Compare-Preload Configuration 
 *                   - Clear Output Compare Reference
 *                   - Select the OCREF Clear signal
 *                   - Enable/Disable the Capture/Compare Channels    
 *                   
 *          3. TIM Input Capture management: this group includes all needed 
 *             functions to configure the Capture/Compare unit used in 
 *             Input Capture mode:
 *                   - Configure each channel in input capture mode
 *                   - Configure Channel1/2 in PWM Input mode
 *                   - Set the Input Capture Prescaler
 *                   - Get the Capture/Compare values      
 *                   
 *          4. Advanced-control timers (TIM1 and TIM8) specific features
 *                   - Configures the Break input, dead time, Lock level, the OSSI,
 *                      the OSSR State and the AOE(automatic output enable)
 *                   - Enable/Disable the TIM peripheral Main Outputs
 *                   - Select the Commutation event
 *                   - Set/Reset the Capture Compare Preload Control bit
 *                              
 *          5. TIM interrupts, DMA and flags management
 *                   - Enable/Disable interrupt sources
 *                   - Get flags status
 *                   - Clear flags/ Pending bits
 *                   - Enable/Disable DMA requests 
 *                   - Configure DMA burst mode
 *                   - Select CaptureCompare DMA request  
 *              
 *          6. TIM clocks management: this group includes all needed functions 
 *             to configure the clock controller unit:
 *                   - Select internal/External clock
 *                   - Select the external clock mode: ETR(Mode1/Mode2), TIx or ITRx
 *         
 *          7. TIM synchronization management: this group includes all needed 
 *             functions to configure the Synchronization unit:
 *                   - Select Input Trigger  
 *                   - Select Output Trigger  
 *                   - Select Master Slave Mode 
 *                   - ETR Configuration when used as external trigger   
 *     
 *          8. TIM specific interface management, this group includes all 
 *             needed functions to use the specific TIM interface:
 *                   - Encoder Interface Configuration
 *                   - Select Hall Sensor   
 *         
 *          9. TIM specific remapping management includes the Remapping 
 *             configuration of specific timers               
 *   
 *  @endverbatim
 *    
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an "AS IS" BASIS, 
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_tim_bsp.h"
//#include "stm32f4xx_rcc.h"
#ifdef  USE_FULL_ASSERT
  #define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
  void assert_failed(uint8_t* file, uint32_t line);
#else
  #define assert_param(expr) ((void)0)
#endif
/** @addtogroup STM32F4xx_StdPeriph_Driver
 * @{
 */

