ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Set the Prescaler value */
    TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

    if ((TIMx == TIM1) || (TIMx == TIM8)) {
        /* Set the Repetition Counter value */
        TIMx->RCR = TIM_TimeBaseInitStruct->TIM_RepetitionCounter;
    }

    /* Generate an update event to reload the Prescaler 
       and the repetition counter(only for TIM1 and TIM8) value immediatly */
    TIMx->EGR = TIM_PSCReloadMode_Immediate;


}

/**
 * @brief  Fills each TIM_TimeBaseInitStruct member with its default value.
 * @param  TIM_TimeBaseInitStruct : pointer to a TIM_TimeBaseInitTypeDef
 *         structure which will be initialized.
 * @retval None
 */
void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct) {
    /* Set the default configuration */
    TIM_TimeBaseInitStruct->TIM_Period = 0xFFFFFFFF;
    TIM_TimeBaseInitStruct->TIM_Prescaler = 0x0000;
    TIM_TimeBaseInitStruct->TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStruct->TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStruct->TIM_RepetitionCounter = 0x0000;
}

/**
 * @brief  Configures the TIMx Prescaler.
 * @param  TIMx: where x can be  1 to 14 to select the TIM peripheral.
 * @param  Prescaler: specifies the Prescaler Register value
 * @param  TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode
 *          This parameter can be one of the following values:
 *            @arg TIM_PSCReloadMode_Update: The Prescaler is loaded at the update event.
 *            @arg TIM_PSCReloadMode_Immediate: The Prescaler is loaded immediatly.
 * @retval None
 */
void TIM_PrescalerConfig(TIM_TypeDef* TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_PRESCALER_RELOAD(TIM_PSCReloadMode));
    /* Set the Prescaler value */
    TIMx->PSC = Prescaler;
    /* Set or reset the UG Bit */
    TIMx->EGR = TIM_PSCReloadMode;
}

/**
 * @brief  Specifies the TIMx Counter Mode to be used.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_CounterMode: specifies the Counter Mode to be used
 *          This parameter can be one of the following values:
 *            @arg TIM_CounterMode_Up: TIM Up Counting Mode
 *            @arg TIM_CounterMode_Down: TIM Down Counting Mode
 *            @arg TIM_CounterMode_CenterAligned1: TIM Center Aligned Mode1
 *            @arg TIM_CounterMode_CenterAligned2: TIM Center Aligned Mode2
 *            @arg TIM_CounterMode_CenterAligned3: TIM Center Aligned Mode3
 * @retval None
 */
void TIM_CounterModeConfig(TIM_TypeDef* TIMx, uint16_t TIM_CounterMode) {
    uint16_t tmpcr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_COUNTER_MODE(TIM_CounterMode));

    tmpcr1 = TIMx->CR1;

    /* Reset the CMS and DIR Bits */
    tmpcr1 &= (uint16_t) ~(TIM_CR1_DIR | TIM_CR1_CMS);

    /* Set the Counter Mode */
    tmpcr1 |= TIM_CounterMode;

    /* Write to TIMx CR1 register */
    TIMx->CR1 = tmpcr1;
}

/**
 * @brief  Sets the TIMx Counter Register value
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  Counter: specifies the Counter register new value.
 * @retval None
 */
void TIM_SetCounter(TIM_TypeDef* TIMx, uint32_t Counter) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Set the Counter Register value */
    TIMx->CNT = Counter;
}

/**
 * @brief  Sets the TIMx Autoreload Register value
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  Autoreload: specifies the Autoreload register new value.
 * @retval None
 */
void TIM_SetAutoreload(TIM_TypeDef* TIMx, uint32_t Autoreload) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Set the Autoreload Register value */
    TIMx->ARR = Autoreload;
}

/**
 * @brief  Gets the TIMx Counter value.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @retval Counter Register value
 */
uint32_t TIM_GetCounter(TIM_TypeDef* TIMx) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Get the Counter Register value */
    return TIMx->CNT;
}

/**
 * @brief  Gets the TIMx Prescaler value.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @retval Prescaler Register value.
 */
uint16_t TIM_GetPrescaler(TIM_TypeDef* TIMx) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Get the Prescaler Register value */
    return TIMx->PSC;
}

/**
 * @brief  Enables or Disables the TIMx Update event.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  NewState: new state of the TIMx UDIS bit
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_UpdateDisableConfig(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Set the Update Disable Bit */
        TIMx->CR1 |= TIM_CR1_UDIS;
    } else {
        /* Reset the Update Disable Bit */
        TIMx->CR1 &= (uint16_t) ~TIM_CR1_UDIS;
    }
}

/**
 * @brief  Configures the TIMx Update Request Interrupt source.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_UpdateSource: specifies the Update source.
 *          This parameter can be one of the following values:
 *            @arg TIM_UpdateSource_Global: Source of update is the counter
 *                 overflow/underflow or the setting of UG bit, or an update
 *                 generation through the slave mode controller.
 *            @arg TIM_UpdateSource_Regular: Source of update is counter overflow/underflow.
 * @retval None
 */
void TIM_UpdateRequestConfig(TIM_TypeDef* TIMx, uint16_t TIM_UpdateSource) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_UPDATE_SOURCE(TIM_UpdateSource));

