ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    if (TIM_UpdateSource != TIM_UpdateSource_Global) {
        /* Set the URS Bit */
        TIMx->CR1 |= TIM_CR1_URS;
    } else {
        /* Reset the URS Bit */
        TIMx->CR1 &= (uint16_t) ~TIM_CR1_URS;
    }
}

/**
 * @brief  Enables or disables TIMx peripheral Preload register on ARR.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  NewState: new state of the TIMx peripheral Preload register
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_ARRPreloadConfig(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Set the ARR Preload Bit */
        TIMx->CR1 |= TIM_CR1_ARPE;
    } else {
        /* Reset the ARR Preload Bit */
        TIMx->CR1 &= (uint16_t) ~TIM_CR1_ARPE;
    }
}

/**
 * @brief  Selects the TIMx's One Pulse Mode.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_OPMode: specifies the OPM Mode to be used.
 *          This parameter can be one of the following values:
 *            @arg TIM_OPMode_Single
 *            @arg TIM_OPMode_Repetitive
 * @retval None
 */
void TIM_SelectOnePulseMode(TIM_TypeDef* TIMx, uint16_t TIM_OPMode) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_OPM_MODE(TIM_OPMode));

    /* Reset the OPM Bit */
    TIMx->CR1 &= (uint16_t) ~TIM_CR1_OPM;

    /* Configure the OPM Mode */
    TIMx->CR1 |= TIM_OPMode;
}

/**
 * @brief  Sets the TIMx Clock Division value.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_CKD: specifies the clock division value.
 *          This parameter can be one of the following value:
 *            @arg TIM_CKD_DIV1: TDTS = Tck_tim
 *            @arg TIM_CKD_DIV2: TDTS = 2*Tck_tim
 *            @arg TIM_CKD_DIV4: TDTS = 4*Tck_tim
 * @retval None
 */
void TIM_SetClockDivision(TIM_TypeDef* TIMx, uint16_t TIM_CKD) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_CKD_DIV(TIM_CKD));

    /* Reset the CKD Bits */
    TIMx->CR1 &= (uint16_t) (~TIM_CR1_CKD);

    /* Set the CKD value */
    TIMx->CR1 |= TIM_CKD;
}

/**
 * @brief  Enables or disables the specified TIM peripheral.
 * @param  TIMx: where x can be 1 to 14 to select the TIMx peripheral.
 * @param  NewState: new state of the TIMx peripheral.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Enable the TIM Counter */
        TIMx->CR1 |= TIM_CR1_CEN;
    } else {
        /* Disable the TIM Counter */
        TIMx->CR1 &= (uint16_t) ~TIM_CR1_CEN;
    }
}
/**
 * @}
 */

/** @defgroup TIM_Group2 Output Compare management functions
 *  @brief    Output Compare management functions 
 *
@verbatim   
 ===============================================================================
                        Output Compare management functions
 ===============================================================================  
   
       ===================================================================      
              TIM Driver: how to use it in Output Compare Mode
       =================================================================== 
       To use the Timer in Output Compare mode, the following steps are mandatory:
       
       1. Enable TIM clock using RCC_APBxPeriphClockCmd(RCC_APBxPeriph_TIMx, ENABLE) function
       
       2. Configure the TIM pins by configuring the corresponding GPIO pins
       
       2. Configure the Time base unit as described in the first part of this driver, 
          if needed, else the Timer will run with the default configuration:
          - Autoreload value = 0xFFFF
          - Prescaler value = 0x0000
          - Counter mode = Up counting
          - Clock Division = TIM_CKD_DIV1
          
       3. Fill the TIM_OCInitStruct with the desired parameters including:
          - The TIM Output Compare mode: TIM_OCMode
          - TIM Output State: TIM_OutputState
          - TIM Pulse value: TIM_Pulse
          - TIM Output Compare Polarity : TIM_OCPolarity
       
       4. Call TIM_OCxInit(TIMx, &TIM_OCInitStruct) to configure the desired channel with the 
          corresponding configuration
       
       5. Call the TIM_Cmd(ENABLE) function to enable the TIM counter.
       
       Note1: All other functions can be used separately to modify, if needed,
              a specific feature of the Timer. 
          
       Note2: In case of PWM mode, this function is mandatory:
              TIM_OCxPreloadConfig(TIMx, TIM_OCPreload_ENABLE); 
              
       Note3: If the corresponding interrupt or DMA request are needed, the user should:
                1. Enable the NVIC (or the DMA) to use the TIM interrupts (or DMA requests). 
                2. Enable the corresponding interrupt (or DMA request) using the function 
                   TIM_ITConfig(TIMx, TIM_IT_CCx) (or TIM_DMA_Cmd(TIMx, TIM_DMA_CCx))   

@endverbatim
 * @{
 */

/**
 * @brief  Initializes the TIMx Channel1 according to the specified parameters in
 *         the TIM_OCInitStruct.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure that contains
 *         the configuration information for the specified TIM peripheral.
 * @retval None
 */
void TIM_OC1Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct) {
    uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
    assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));

