ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC1E;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Get the TIMx CR2 register value */
    tmpcr2 = TIMx->CR2;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare Mode Bits */
    tmpccmrx &= (uint16_t) ~TIM_CCMR1_OC1M;
    tmpccmrx &= (uint16_t) ~TIM_CCMR1_CC1S;
    /* Select the Output Compare Mode */
    tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;

    /* Reset the Output Polarity level */
    tmpccer &= (uint16_t) ~TIM_CCER_CC1P;
    /* Set the Output Compare Polarity */
    tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;

    /* Set the Output State */
    tmpccer |= TIM_OCInitStruct->TIM_OutputState;

    if ((TIMx == TIM1) || (TIMx == TIM8)) {
        assert_param(IS_TIM_OUTPUTN_STATE(TIM_OCInitStruct->TIM_OutputNState));
        assert_param(IS_TIM_OCN_POLARITY(TIM_OCInitStruct->TIM_OCNPolarity));
        assert_param(IS_TIM_OCNIDLE_STATE(TIM_OCInitStruct->TIM_OCNIdleState));
        assert_param(IS_TIM_OCIDLE_STATE(TIM_OCInitStruct->TIM_OCIdleState));

        /* Reset the Output N Polarity level */
        tmpccer &= (uint16_t) ~TIM_CCER_CC1NP;
        /* Set the Output N Polarity */
        tmpccer |= TIM_OCInitStruct->TIM_OCNPolarity;
        /* Reset the Output N State */
        tmpccer &= (uint16_t) ~TIM_CCER_CC1NE;

        /* Set the Output N State */
        tmpccer |= TIM_OCInitStruct->TIM_OutputNState;
        /* Reset the Output Compare and Output Compare N IDLE State */
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS1;
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS1N;
        /* Set the Output Idle state */
        tmpcr2 |= TIM_OCInitStruct->TIM_OCIdleState;
        /* Set the Output N Idle state */
        tmpcr2 |= TIM_OCInitStruct->TIM_OCNIdleState;
    }
    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR1 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel2 according to the specified parameters 
 *         in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure that contains
 *         the configuration information for the specified TIM peripheral.
 * @retval None
 */
void TIM_OC2Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct) {
    uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
    assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));

    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC2E;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Get the TIMx CR2 register value */
    tmpcr2 = TIMx->CR2;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= (uint16_t) ~TIM_CCMR1_OC2M;
    tmpccmrx &= (uint16_t) ~TIM_CCMR1_CC2S;

    /* Select the Output Compare Mode */
    tmpccmrx |= (uint16_t) (TIM_OCInitStruct->TIM_OCMode << 8);

    /* Reset the Output Polarity level */
    tmpccer &= (uint16_t) ~TIM_CCER_CC2P;
    /* Set the Output Compare Polarity */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OCPolarity << 4);

    /* Set the Output State */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OutputState << 4);

    if ((TIMx == TIM1) || (TIMx == TIM8)) {
        assert_param(IS_TIM_OUTPUTN_STATE(TIM_OCInitStruct->TIM_OutputNState));
        assert_param(IS_TIM_OCN_POLARITY(TIM_OCInitStruct->TIM_OCNPolarity));
        assert_param(IS_TIM_OCNIDLE_STATE(TIM_OCInitStruct->TIM_OCNIdleState));
        assert_param(IS_TIM_OCIDLE_STATE(TIM_OCInitStruct->TIM_OCIdleState));

        /* Reset the Output N Polarity level */
        tmpccer &= (uint16_t) ~TIM_CCER_CC2NP;
        /* Set the Output N Polarity */
        tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OCNPolarity << 4);
        /* Reset the Output N State */
        tmpccer &= (uint16_t) ~TIM_CCER_CC2NE;

        /* Set the Output N State */
        tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OutputNState << 4);
        /* Reset the Output Compare and Output Compare N IDLE State */
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS2;
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS2N;
        /* Set the Output Idle state */
        tmpcr2 |= (uint16_t) (TIM_OCInitStruct->TIM_OCIdleState << 2);
        /* Set the Output N Idle state */
        tmpcr2 |= (uint16_t) (TIM_OCInitStruct->TIM_OCNIdleState << 2);
    }
    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR2 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel3 according to the specified parameters
 *         in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure that contains
 *         the configuration information for the specified TIM peripheral.
 * @retval None
 */
void TIM_OC3Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct) {
    uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
    assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));

    /* Disable the Channel 3: Reset the CC2E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC3E;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Get the TIMx CR2 register value */
    tmpcr2 = TIMx->CR2;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= (uint16_t) ~TIM_CCMR2_OC3M;
    tmpccmrx &= (uint16_t) ~TIM_CCMR2_CC3S;
    /* Select the Output Compare Mode */
    tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;

    /* Reset the Output Polarity level */
    tmpccer &= (uint16_t) ~TIM_CCER_CC3P;
    /* Set the Output Compare Polarity */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OCPolarity << 8);

    /* Set the Output State */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OutputState << 8);

    if ((TIMx == TIM1) || (TIMx == TIM8)) {
        assert_param(IS_TIM_OUTPUTN_STATE(TIM_OCInitStruct->TIM_OutputNState));
        assert_param(IS_TIM_OCN_POLARITY(TIM_OCInitStruct->TIM_OCNPolarity));
        assert_param(IS_TIM_OCNIDLE_STATE(TIM_OCInitStruct->TIM_OCNIdleState));
        assert_param(IS_TIM_OCIDLE_STATE(TIM_OCInitStruct->TIM_OCIdleState));

        /* Reset the Output N Polarity level */
        tmpccer &= (uint16_t) ~TIM_CCER_CC3NP;
        /* Set the Output N Polarity */
        tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OCNPolarity << 8);
        /* Reset the Output N State */
        tmpccer &= (uint16_t) ~TIM_CCER_CC3NE;

        /* Set the Output N State */
        tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OutputNState << 8);
        /* Reset the Output Compare and Output Compare N IDLE State */
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS3;
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS3N;
        /* Set the Output Idle state */
        tmpcr2 |= (uint16_t) (TIM_OCInitStruct->TIM_OCIdleState << 4);
        /* Set the Output N Idle state */
        tmpcr2 |= (uint16_t) (TIM_OCInitStruct->TIM_OCNIdleState << 4);
    }
    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

