ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR3 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel4 according to the specified parameters
 *         in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure that contains
 *         the configuration information for the specified TIM peripheral.
 * @retval None
 */
void TIM_OC4Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct) {
    uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OC_MODE(TIM_OCInitStruct->TIM_OCMode));
    assert_param(IS_TIM_OUTPUT_STATE(TIM_OCInitStruct->TIM_OutputState));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCInitStruct->TIM_OCPolarity));

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC4E;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Get the TIMx CR2 register value */
    tmpcr2 = TIMx->CR2;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= (uint16_t) ~TIM_CCMR2_OC4M;
    tmpccmrx &= (uint16_t) ~TIM_CCMR2_CC4S;

    /* Select the Output Compare Mode */
    tmpccmrx |= (uint16_t) (TIM_OCInitStruct->TIM_OCMode << 8);

    /* Reset the Output Polarity level */
    tmpccer &= (uint16_t) ~TIM_CCER_CC4P;
    /* Set the Output Compare Polarity */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OCPolarity << 12);

    /* Set the Output State */
    tmpccer |= (uint16_t) (TIM_OCInitStruct->TIM_OutputState << 12);

    if ((TIMx == TIM1) || (TIMx == TIM8)) {
        assert_param(IS_TIM_OCIDLE_STATE(TIM_OCInitStruct->TIM_OCIdleState));
        /* Reset the Output Compare IDLE State */
        tmpcr2 &= (uint16_t) ~TIM_CR2_OIS4;
        /* Set the Output Idle state */
        tmpcr2 |= (uint16_t) (TIM_OCInitStruct->TIM_OCIdleState << 6);
    }
    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR4 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Fills each TIM_OCInitStruct member with its default value.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure which will
 *         be initialized.
 * @retval None
 */
void TIM_OCStructInit(TIM_OCInitTypeDef* TIM_OCInitStruct) {
    /* Set the default configuration */
    TIM_OCInitStruct->TIM_OCMode = TIM_OCMode_Timing;
    TIM_OCInitStruct->TIM_OutputState = TIM_OutputState_Disable;
    TIM_OCInitStruct->TIM_OutputNState = TIM_OutputNState_Disable;
    TIM_OCInitStruct->TIM_Pulse = 0x00000000;
    TIM_OCInitStruct->TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OCInitStruct->TIM_OCNPolarity = TIM_OCPolarity_High;
    TIM_OCInitStruct->TIM_OCIdleState = TIM_OCIdleState_Reset;
    TIM_OCInitStruct->TIM_OCNIdleState = TIM_OCNIdleState_Reset;
}

/**
 * @brief  Selects the TIM Output Compare Mode.
 * @note   This function disables the selected channel before changing the Output
 *         Compare Mode. If needed, user has to enable this channel using
 *         TIM_CCxCmd() and TIM_CCxNCmd() functions.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_Channel: specifies the TIM Channel
 *          This parameter can be one of the following values:
 *            @arg TIM_Channel_1: TIM Channel 1
 *            @arg TIM_Channel_2: TIM Channel 2
 *            @arg TIM_Channel_3: TIM Channel 3
 *            @arg TIM_Channel_4: TIM Channel 4
 * @param  TIM_OCMode: specifies the TIM Output Compare Mode.
 *           This parameter can be one of the following values:
 *            @arg TIM_OCMode_Timing
 *            @arg TIM_OCMode_Active
 *            @arg TIM_OCMode_Toggle
 *            @arg TIM_OCMode_PWM1
 *            @arg TIM_OCMode_PWM2
 *            @arg TIM_ForcedAction_Active
 *            @arg TIM_ForcedAction_InActive
 * @retval None
 */
void TIM_SelectOCxM(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode) {
    uint32_t tmp = 0;
    uint16_t tmp1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_CHANNEL(TIM_Channel));
    assert_param(IS_TIM_OCM(TIM_OCMode));

    tmp = (uint32_t) TIMx;
    tmp += CCMR_OFFSET;

    tmp1 = CCER_CCE_SET << (uint16_t) TIM_Channel;

    /* Disable the Channel: Reset the CCxE Bit */
    TIMx->CCER &= (uint16_t) ~tmp1;

    if ((TIM_Channel == TIM_Channel_1) || (TIM_Channel == TIM_Channel_3)) {
        tmp += (TIM_Channel >> 1);

        /* Reset the OCxM bits in the CCMRx register */
        *(__IO uint32_t *) tmp &= CCMR_OC13M_MASK;

        /* Configure the OCxM bits in the CCMRx register */
        *(__IO uint32_t *) tmp |= TIM_OCMode;
    } else {
        tmp += (uint16_t) (TIM_Channel - (uint16_t) 4) >> (uint16_t) 1;

        /* Reset the OCxM bits in the CCMRx register */
        *(__IO uint32_t *) tmp &= CCMR_OC24M_MASK;

        /* Configure the OCxM bits in the CCMRx register */
        *(__IO uint32_t *) tmp |= (uint16_t) (TIM_OCMode << 8);
    }
}

/**
 * @brief  Sets the TIMx Capture Compare1 Register value
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  Compare1: specifies the Capture Compare1 register new value.
 * @retval None
 */
void TIM_SetCompare1(TIM_TypeDef* TIMx, uint32_t Compare1) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));

    /* Set the Capture Compare1 Register value */
    TIMx->CCR1 = Compare1;
}

/**
 * @brief  Sets the TIMx Capture Compare2 Register value
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  Compare2: specifies the Capture Compare2 register new value.
 * @retval None
 */
void TIM_SetCompare2(TIM_TypeDef* TIMx, uint32_t Compare2) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));

    /* Set the Capture Compare2 Register value */
    TIMx->CCR2 = Compare2;
}

/**
 * @brief  Sets the TIMx Capture Compare3 Register value
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  Compare3: specifies the Capture Compare3 register new value.
 * @retval None
 */
void TIM_SetCompare3(TIM_TypeDef* TIMx, uint32_t Compare3) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));

    /* Set the Capture Compare3 Register value */
    TIMx->CCR3 = Compare3;
}

/**
 * @brief  Sets the TIMx Capture Compare4 Register value
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  Compare4: specifies the Capture Compare4 register new value.
 * @retval None
 */
void TIM_SetCompare4(TIM_TypeDef* TIMx, uint32_t Compare4) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));

