ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Set the Capture Compare4 Register value */
    TIMx->CCR4 = Compare4;
}

/**
 * @brief  Forces the TIMx output 1 waveform to active or inactive level.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *          This parameter can be one of the following values:
 *            @arg TIM_ForcedAction_Active: Force active level on OC1REF
 *            @arg TIM_ForcedAction_InActive: Force inactive level on OC1REF.
 * @retval None
 */
void TIM_ForcedOC1Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_FORCED_ACTION(TIM_ForcedAction));
    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC1M Bits */
    tmpccmr1 &= (uint16_t) ~TIM_CCMR1_OC1M;

    /* Configure The Forced output Mode */
    tmpccmr1 |= TIM_ForcedAction;

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Forces the TIMx output 2 waveform to active or inactive level.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *          This parameter can be one of the following values:
 *            @arg TIM_ForcedAction_Active: Force active level on OC2REF
 *            @arg TIM_ForcedAction_InActive: Force inactive level on OC2REF.
 * @retval None
 */
void TIM_ForcedOC2Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_FORCED_ACTION(TIM_ForcedAction));
    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC2M Bits */
    tmpccmr1 &= (uint16_t) ~TIM_CCMR1_OC2M;

    /* Configure The Forced output Mode */
    tmpccmr1 |= (uint16_t) (TIM_ForcedAction << 8);

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Forces the TIMx output 3 waveform to active or inactive level.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *          This parameter can be one of the following values:
 *            @arg TIM_ForcedAction_Active: Force active level on OC3REF
 *            @arg TIM_ForcedAction_InActive: Force inactive level on OC3REF.
 * @retval None
 */
void TIM_ForcedOC3Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_FORCED_ACTION(TIM_ForcedAction));

    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC1M Bits */
    tmpccmr2 &= (uint16_t) ~TIM_CCMR2_OC3M;

    /* Configure The Forced output Mode */
    tmpccmr2 |= TIM_ForcedAction;

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Forces the TIMx output 4 waveform to active or inactive level.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *          This parameter can be one of the following values:
 *            @arg TIM_ForcedAction_Active: Force active level on OC4REF
 *            @arg TIM_ForcedAction_InActive: Force inactive level on OC4REF.
 * @retval None
 */
void TIM_ForcedOC4Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_FORCED_ACTION(TIM_ForcedAction));
    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC2M Bits */
    tmpccmr2 &= (uint16_t) ~TIM_CCMR2_OC4M;

    /* Configure The Forced output Mode */
    tmpccmr2 |= (uint16_t) (TIM_ForcedAction << 8);

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR1.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPreload_Enable
 *            @arg TIM_OCPreload_Disable
 * @retval None
 */
void TIM_OC1PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_OCPRELOAD_STATE(TIM_OCPreload));

    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC1PE Bit */
    tmpccmr1 &= (uint16_t) (~TIM_CCMR1_OC1PE);

    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr1 |= TIM_OCPreload;

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR2.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPreload_Enable
 *            @arg TIM_OCPreload_Disable
 * @retval None
 */
void TIM_OC2PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_OCPRELOAD_STATE(TIM_OCPreload));

    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC2PE Bit */
    tmpccmr1 &= (uint16_t) (~TIM_CCMR1_OC2PE);

    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr1 |= (uint16_t) (TIM_OCPreload << 8);

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR3.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPreload_Enable
 *            @arg TIM_OCPreload_Disable
 * @retval None
 */
void TIM_OC3PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCPRELOAD_STATE(TIM_OCPreload));

    tmpccmr2 = TIMx->CCMR2;

