ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Reset the OC3PE Bit */
    tmpccmr2 &= (uint16_t) (~TIM_CCMR2_OC3PE);

    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr2 |= TIM_OCPreload;

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR4.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPreload_Enable
 *            @arg TIM_OCPreload_Disable
 * @retval None
 */
void TIM_OC4PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCPRELOAD_STATE(TIM_OCPreload));

    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC4PE Bit */
    tmpccmr2 &= (uint16_t) (~TIM_CCMR2_OC4PE);

    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr2 |= (uint16_t) (TIM_OCPreload << 8);

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx Output Compare 1 Fast feature.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCFast_Enable: TIM output compare fast enable
 *            @arg TIM_OCFast_Disable: TIM output compare fast disable
 * @retval None
 */
void TIM_OC1FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_OCFAST_STATE(TIM_OCFast));

    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC1FE Bit */
    tmpccmr1 &= (uint16_t) ~TIM_CCMR1_OC1FE;

    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr1 |= TIM_OCFast;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Configures the TIMx Output Compare 2 Fast feature.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCFast_Enable: TIM output compare fast enable
 *            @arg TIM_OCFast_Disable: TIM output compare fast disable
 * @retval None
 */
void TIM_OC2FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_OCFAST_STATE(TIM_OCFast));

    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC2FE Bit */
    tmpccmr1 &= (uint16_t) (~TIM_CCMR1_OC2FE);

    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr1 |= (uint16_t) (TIM_OCFast << 8);

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Configures the TIMx Output Compare 3 Fast feature.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCFast_Enable: TIM output compare fast enable
 *            @arg TIM_OCFast_Disable: TIM output compare fast disable
 * @retval None
 */
void TIM_OC3FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCFAST_STATE(TIM_OCFast));

    /* Get the TIMx CCMR2 register value */
    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC3FE Bit */
    tmpccmr2 &= (uint16_t) ~TIM_CCMR2_OC3FE;

    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr2 |= TIM_OCFast;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx Output Compare 4 Fast feature.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCFast_Enable: TIM output compare fast enable
 *            @arg TIM_OCFast_Disable: TIM output compare fast disable
 * @retval None
 */
void TIM_OC4FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCFAST_STATE(TIM_OCFast));

    /* Get the TIMx CCMR2 register value */
    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC4FE Bit */
    tmpccmr2 &= (uint16_t) (~TIM_CCMR2_OC4FE);

    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr2 |= (uint16_t) (TIM_OCFast << 8);

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Clears or safeguards the OCREF1 signal on an external event
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCClear_Enable: TIM Output clear enable
 *            @arg TIM_OCClear_Disable: TIM Output clear disable
 * @retval None
 */
void TIM_ClearOC1Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_OCCLEAR_STATE(TIM_OCClear));

    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC1CE Bit */
    tmpccmr1 &= (uint16_t) ~TIM_CCMR1_OC1CE;

