ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr1 |= TIM_OCClear;

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Clears or safeguards the OCREF2 signal on an external event
 * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCClear_Enable: TIM Output clear enable
 *            @arg TIM_OCClear_Disable: TIM Output clear disable
 * @retval None
 */
void TIM_ClearOC2Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear) {
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_OCCLEAR_STATE(TIM_OCClear));

    tmpccmr1 = TIMx->CCMR1;

    /* Reset the OC2CE Bit */
    tmpccmr1 &= (uint16_t) ~TIM_CCMR1_OC2CE;

    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr1 |= (uint16_t) (TIM_OCClear << 8);

    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Clears or safeguards the OCREF3 signal on an external event
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCClear_Enable: TIM Output clear enable
 *            @arg TIM_OCClear_Disable: TIM Output clear disable
 * @retval None
 */
void TIM_ClearOC3Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCCLEAR_STATE(TIM_OCClear));

    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC3CE Bit */
    tmpccmr2 &= (uint16_t) ~TIM_CCMR2_OC3CE;

    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr2 |= TIM_OCClear;

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Clears or safeguards the OCREF4 signal on an external event
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *          This parameter can be one of the following values:
 *            @arg TIM_OCClear_Enable: TIM Output clear enable
 *            @arg TIM_OCClear_Disable: TIM Output clear disable
 * @retval None
 */
void TIM_ClearOC4Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear) {
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OCCLEAR_STATE(TIM_OCClear));

    tmpccmr2 = TIMx->CCMR2;

    /* Reset the OC4CE Bit */
    tmpccmr2 &= (uint16_t) ~TIM_CCMR2_OC4CE;

    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr2 |= (uint16_t) (TIM_OCClear << 8);

    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx channel 1 polarity.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC1 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPolarity_High: Output Compare active high
 *            @arg TIM_OCPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC1PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC1P Bit */
    tmpccer &= (uint16_t) (~TIM_CCER_CC1P);
    tmpccer |= TIM_OCPolarity;

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx Channel 1N polarity.
 * @param  TIMx: where x can be 1 or 8 to select the TIM peripheral.
 * @param  TIM_OCNPolarity: specifies the OC1N Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCNPolarity_High: Output Compare active high
 *            @arg TIM_OCNPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC1NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity) {
    uint16_t tmpccer = 0;
    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_TIM_OCN_POLARITY(TIM_OCNPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC1NP Bit */
    tmpccer &= (uint16_t) ~TIM_CCER_CC1NP;
    tmpccer |= TIM_OCNPolarity;

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 2 polarity.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_OCPolarity: specifies the OC2 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPolarity_High: Output Compare active high
 *            @arg TIM_OCPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC2PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC2P Bit */
    tmpccer &= (uint16_t) (~TIM_CCER_CC2P);
    tmpccer |= (uint16_t) (TIM_OCPolarity << 4);

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx Channel 2N polarity.
 * @param  TIMx: where x can be 1 or 8 to select the TIM peripheral.
 * @param  TIM_OCNPolarity: specifies the OC2N Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCNPolarity_High: Output Compare active high
 *            @arg TIM_OCNPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC2NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_TIM_OCN_POLARITY(TIM_OCNPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC2NP Bit */
    tmpccer &= (uint16_t) ~TIM_CCER_CC2NP;
    tmpccer |= (uint16_t) (TIM_OCNPolarity << 4);

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 3 polarity.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC3 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPolarity_High: Output Compare active high
 *            @arg TIM_OCPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC3PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC3P Bit */
    tmpccer &= (uint16_t) ~TIM_CCER_CC3P;
    tmpccer |= (uint16_t) (TIM_OCPolarity << 8);

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx Channel 3N polarity.
 * @param  TIMx: where x can be 1 or 8 to select the TIM peripheral.
 * @param  TIM_OCNPolarity: specifies the OC3N Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCNPolarity_High: Output Compare active high
 *            @arg TIM_OCNPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC3NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_TIM_OCN_POLARITY(TIM_OCNPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC3NP Bit */
    tmpccer &= (uint16_t) ~TIM_CCER_CC3NP;
    tmpccer |= (uint16_t) (TIM_OCNPolarity << 8);

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 4 polarity.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC4 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_OCPolarity_High: Output Compare active high
 *            @arg TIM_OCPolarity_Low: Output Compare active low
 * @retval None
 */
void TIM_OC4PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity) {
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_OC_POLARITY(TIM_OCPolarity));

    tmpccer = TIMx->CCER;

    /* Set or Reset the CC4P Bit */
    tmpccer &= (uint16_t) ~TIM_CCER_CC4P;
    tmpccer |= (uint16_t) (TIM_OCPolarity << 12);

    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Enables or disables the TIM Capture Compare Channel x.
 * @param  TIMx: where x can be 1 to 14 except 6 and 7, to select the TIM peripheral.
 * @param  TIM_Channel: specifies the TIM Channel
 *          This parameter can be one of the following values:
 *            @arg TIM_Channel_1: TIM Channel 1
 *            @arg TIM_Channel_2: TIM Channel 2
 *            @arg TIM_Channel_3: TIM Channel 3
 *            @arg TIM_Channel_4: TIM Channel 4
 * @param  TIM_CCx: specifies the TIM Channel CCxE bit new state.
 *          This parameter can be: TIM_CCx_Enable or TIM_CCx_Disable. 
 * @retval None
 */
void TIM_CCxCmd(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCx) {
    uint16_t tmp = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST1_PERIPH(TIMx));
    assert_param(IS_TIM_CHANNEL(TIM_Channel));
    assert_param(IS_TIM_CCX(TIM_CCx));

    tmp = CCER_CCE_SET << TIM_Channel;

    /* Reset the CCxE Bit */
    TIMx->CCER &= (uint16_t) ~tmp;

    /* Set or reset the CCxE Bit */
    TIMx->CCER |= (uint16_t) (TIM_CCx << TIM_Channel);
}

/**
 * @brief  Enables or disables the TIM Capture Compare Channel xN.
 * @param  TIMx: where x can be 1 or 8 to select the TIM peripheral.
 * @param  TIM_Channel: specifies the TIM Channel
 *          This parameter can be one of the following values:
 *            @arg TIM_Channel_1: TIM Channel 1
 *            @arg TIM_Channel_2: TIM Channel 2
 *            @arg TIM_Channel_3: TIM Channel 3
 * @param  TIM_CCxN: specifies the TIM Channel CCxNE bit new state.
 *          This parameter can be: TIM_CCxN_Enable or TIM_CCxN_Disable. 
 * @retval None
 */
void TIM_CCxNCmd(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCxN) {
    uint16_t tmp = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_TIM_COMPLEMENTARY_CHANNEL(TIM_Channel));
    assert_param(IS_TIM_CCXN(TIM_CCxN));

