ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    if (NewState != DISABLE) {
        /* Enable the TIM Main Output */
        TIMx->BDTR |= TIM_BDTR_MOE;
    } else {
        /* Disable the TIM Main Output */
        TIMx->BDTR &= (uint16_t) ~TIM_BDTR_MOE;
    }
}

/**
 * @brief  Selects the TIM peripheral Commutation event.
 * @param  TIMx: where x can be  1 or 8 to select the TIMx peripheral
 * @param  NewState: new state of the Commutation event.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_SelectCOM(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Set the COM Bit */
        TIMx->CR2 |= TIM_CR2_CCUS;
    } else {
        /* Reset the COM Bit */
        TIMx->CR2 &= (uint16_t) ~TIM_CR2_CCUS;
    }
}

/**
 * @brief  Sets or Resets the TIM peripheral Capture Compare Preload Control bit.
 * @param  TIMx: where x can be  1 or 8 to select the TIMx peripheral
 * @param  NewState: new state of the Capture Compare Preload Control bit
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_CCPreloadControl(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST4_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE) {
        /* Set the CCPC Bit */
        TIMx->CR2 |= TIM_CR2_CCPC;
    } else {
        /* Reset the CCPC Bit */
        TIMx->CR2 &= (uint16_t) ~TIM_CR2_CCPC;
    }
}
/**
 * @}
 */

/** @defgroup TIM_Group5 Interrupts DMA and flags management functions
 *  @brief    Interrupts, DMA and flags management functions 
 *
@verbatim   
 ===============================================================================
                 Interrupts, DMA and flags management functions
 ===============================================================================  

@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the specified TIM interrupts.
 * @param  TIMx: where x can be 1 to 14 to select the TIMx peripheral.
 * @param  TIM_IT: specifies the TIM interrupts sources to be enabled or disabled.
 *          This parameter can be any combination of the following values:
 *            @arg TIM_IT_Update: TIM update Interrupt source
 *            @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source
 *            @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source
 *            @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source
 *            @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source
 *            @arg TIM_IT_COM: TIM Commutation Interrupt source
 *            @arg TIM_IT_Trigger: TIM Trigger Interrupt source
 *            @arg TIM_IT_Break: TIM Break Interrupt source
 *  
 * @note   For TIM6 and TIM7 only the parameter TIM_IT_Update can be used
 * @note   For TIM9 and TIM12 only one of the following parameters can be used: TIM_IT_Update,
 *          TIM_IT_CC1, TIM_IT_CC2 or TIM_IT_Trigger. 
 * @note   For TIM10, TIM11, TIM13 and TIM14 only one of the following parameters can
 *          be used: TIM_IT_Update or TIM_IT_CC1   
 * @note   TIM_IT_COM and TIM_IT_Break can be used only with TIM1 and TIM8 
 *        
 * @param  NewState: new state of the TIM interrupts.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_ITConfig(TIM_TypeDef* TIMx, uint16_t TIM_IT, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_IT(TIM_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Enable the Interrupt sources */
        TIMx->DIER |= TIM_IT;
    } else {
        /* Disable the Interrupt sources */
        TIMx->DIER &= (uint16_t) ~TIM_IT;
    }
}

/**
 * @brief  Configures the TIMx event to be generate by software.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_EventSource: specifies the event source.
 *          This parameter can be one or more of the following values:	   
 *            @arg TIM_EventSource_Update: Timer update Event source
 *            @arg TIM_EventSource_CC1: Timer Capture Compare 1 Event source
 *            @arg TIM_EventSource_CC2: Timer Capture Compare 2 Event source
 *            @arg TIM_EventSource_CC3: Timer Capture Compare 3 Event source
 *            @arg TIM_EventSource_CC4: Timer Capture Compare 4 Event source
 *            @arg TIM_EventSource_COM: Timer COM event source  
 *            @arg TIM_EventSource_Trigger: Timer Trigger Event source
 *            @arg TIM_EventSource_Break: Timer Break event source
 * 
 * @note   TIM6 and TIM7 can only generate an update event. 
 * @note   TIM_EventSource_COM and TIM_EventSource_Break are used only with TIM1 and TIM8.
 *        
 * @retval None
 */
void TIM_GenerateEvent(TIM_TypeDef* TIMx, uint16_t TIM_EventSource) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_EVENT_SOURCE(TIM_EventSource));

    /* Set the event sources */
    TIMx->EGR = TIM_EventSource;
}

/**
 * @brief  Checks whether the specified TIM flag is set or not.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag to check.
 *          This parameter can be one of the following values:
 *            @arg TIM_FLAG_Update: TIM update Flag
 *            @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag
 *            @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag
 *            @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag
 *            @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag
 *            @arg TIM_FLAG_COM: TIM Commutation Flag
 *            @arg TIM_FLAG_Trigger: TIM Trigger Flag
 *            @arg TIM_FLAG_Break: TIM Break Flag
 *            @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 over capture Flag
 *            @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 over capture Flag
 *            @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 over capture Flag
 *            @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 over capture Flag
 *
 * @note   TIM6 and TIM7 can have only one update flag. 
 * @note   TIM_FLAG_COM and TIM_FLAG_Break are used only with TIM1 and TIM8.    
 *
 * @retval The new state of TIM_FLAG (SET or RESET).
 */
FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, uint16_t TIM_FLAG) {
    ITStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_GET_FLAG(TIM_FLAG));


    if ((TIMx->SR & TIM_FLAG) != (uint16_t) RESET) {
        bitstatus = SET;
    } else {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the TIMx's pending flags.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag bit to clear.
 *          This parameter can be any combination of the following values:
 *            @arg TIM_FLAG_Update: TIM update Flag
 *            @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag
 *            @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag
 *            @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag
 *            @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag
 *            @arg TIM_FLAG_COM: TIM Commutation Flag
 *            @arg TIM_FLAG_Trigger: TIM Trigger Flag
 *            @arg TIM_FLAG_Break: TIM Break Flag
 *            @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 over capture Flag
 *            @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 over capture Flag
 *            @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 over capture Flag
 *            @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 over capture Flag
 *
 * @note   TIM6 and TIM7 can have only one update flag. 
 * @note   TIM_FLAG_COM and TIM_FLAG_Break are used only with TIM1 and TIM8.
 *    
 * @retval None
 */
void TIM_ClearFlag(TIM_TypeDef* TIMx, uint16_t TIM_FLAG) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Clear the flags */
    TIMx->SR = (uint16_t) ~TIM_FLAG;
}

/**
 * @brief  Checks whether the TIM interrupt has occurred or not.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_IT: specifies the TIM interrupt source to check.
 *          This parameter can be one of the following values:
 *            @arg TIM_IT_Update: TIM update Interrupt source
 *            @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source
 *            @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source
 *            @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source
 *            @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source
 *            @arg TIM_IT_COM: TIM Commutation Interrupt source
 *            @arg TIM_IT_Trigger: TIM Trigger Interrupt source
 *            @arg TIM_IT_Break: TIM Break Interrupt source
 *
 * @note   TIM6 and TIM7 can generate only an update interrupt.
 * @note   TIM_IT_COM and TIM_IT_Break are used only with TIM1 and TIM8.
 *     
 * @retval The new state of the TIM_IT(SET or RESET).
 */
ITStatus TIM_GetITStatus(TIM_TypeDef* TIMx, uint16_t TIM_IT) {
    ITStatus bitstatus = RESET;
    uint16_t itstatus = 0x0, itenable = 0x0;
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));
    assert_param(IS_TIM_GET_IT(TIM_IT));

