ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    itstatus = TIMx->SR & TIM_IT;

    itenable = TIMx->DIER & TIM_IT;
    if ((itstatus != (uint16_t) RESET) && (itenable != (uint16_t) RESET)) {
        bitstatus = SET;
    } else {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the TIMx's interrupt pending bits.
 * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
 * @param  TIM_IT: specifies the pending bit to clear.
 *          This parameter can be any combination of the following values:
 *            @arg TIM_IT_Update: TIM1 update Interrupt source
 *            @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source
 *            @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source
 *            @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source
 *            @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source
 *            @arg TIM_IT_COM: TIM Commutation Interrupt source
 *            @arg TIM_IT_Trigger: TIM Trigger Interrupt source
 *            @arg TIM_IT_Break: TIM Break Interrupt source
 *
 * @note   TIM6 and TIM7 can generate only an update interrupt.
 * @note   TIM_IT_COM and TIM_IT_Break are used only with TIM1 and TIM8.
 *      
 * @retval None
 */
void TIM_ClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT) {
    /* Check the parameters */
    assert_param(IS_TIM_ALL_PERIPH(TIMx));

    /* Clear the IT pending Bit */
    TIMx->SR = (uint16_t) ~TIM_IT;
}

/**
 * @brief  Configures the TIMx's DMA interface.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_DMABase: DMA Base address.
 *          This parameter can be one of the following values:
 *            @arg TIM_DMABase_CR1  
 *            @arg TIM_DMABase_CR2
 *            @arg TIM_DMABase_SMCR
 *            @arg TIM_DMABase_DIER
 *            @arg TIM1_DMABase_SR
 *            @arg TIM_DMABase_EGR
 *            @arg TIM_DMABase_CCMR1
 *            @arg TIM_DMABase_CCMR2
 *            @arg TIM_DMABase_CCER
 *            @arg TIM_DMABase_CNT   
 *            @arg TIM_DMABase_PSC   
 *            @arg TIM_DMABase_ARR
 *            @arg TIM_DMABase_RCR
 *            @arg TIM_DMABase_CCR1
 *            @arg TIM_DMABase_CCR2
 *            @arg TIM_DMABase_CCR3  
 *            @arg TIM_DMABase_CCR4
 *            @arg TIM_DMABase_BDTR
 *            @arg TIM_DMABase_DCR
 * @param  TIM_DMABurstLength: DMA Burst length. This parameter can be one value
 *         between: TIM_DMABurstLength_1Transfer and TIM_DMABurstLength_18Transfers.
 * @retval None
 */
void TIM_DMAConfig(TIM_TypeDef* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_DMA_BASE(TIM_DMABase));
    assert_param(IS_TIM_DMA_LENGTH(TIM_DMABurstLength));

    /* Set the DMA Base and the DMA Burst Length */
    TIMx->DCR = TIM_DMABase | TIM_DMABurstLength;
}

/**
 * @brief  Enables or disables the TIMx's DMA Requests.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 6, 7 or 8 to select the TIM peripheral.
 * @param  TIM_DMASource: specifies the DMA Request sources.
 *          This parameter can be any combination of the following values:
 *            @arg TIM_DMA_Update: TIM update Interrupt source
 *            @arg TIM_DMA_CC1: TIM Capture Compare 1 DMA source
 *            @arg TIM_DMA_CC2: TIM Capture Compare 2 DMA source
 *            @arg TIM_DMA_CC3: TIM Capture Compare 3 DMA source
 *            @arg TIM_DMA_CC4: TIM Capture Compare 4 DMA source
 *            @arg TIM_DMA_COM: TIM Commutation DMA source
 *            @arg TIM_DMA_Trigger: TIM Trigger DMA source
 * @param  NewState: new state of the DMA Request sources.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_DMACmd(TIM_TypeDef* TIMx, uint16_t TIM_DMASource, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST5_PERIPH(TIMx));
    assert_param(IS_TIM_DMA_SOURCE(TIM_DMASource));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Enable the DMA sources */
        TIMx->DIER |= TIM_DMASource;
    } else {
        /* Disable the DMA sources */
        TIMx->DIER &= (uint16_t) ~TIM_DMASource;
    }
}

/**
 * @brief  Selects the TIMx peripheral Capture Compare DMA source.
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  NewState: new state of the Capture Compare DMA source
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_SelectCCDMA(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Set the CCDS Bit */
        TIMx->CR2 |= TIM_CR2_CCDS;
    } else {
        /* Reset the CCDS Bit */
        TIMx->CR2 &= (uint16_t) ~TIM_CR2_CCDS;
    }
}
/**
 * @}
 */

/** @defgroup TIM_Group6 Clocks management functions
 *  @brief    Clocks management functions
 *
@verbatim   
 ===============================================================================
                         Clocks management functions
 ===============================================================================  

@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIMx internal Clock
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @retval None
 */
void TIM_InternalClockConfig(TIM_TypeDef* TIMx) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));

    /* Disable slave mode to clock the prescaler directly with the internal clock */
    TIMx->SMCR &= (uint16_t) ~TIM_SMCR_SMS;
}

/**
 * @brief  Configures the TIMx Internal Trigger as External Clock
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_InputTriggerSource: Trigger source.
 *          This parameter can be one of the following values:
 *            @arg TIM_TS_ITR0: Internal Trigger 0
 *            @arg TIM_TS_ITR1: Internal Trigger 1
 *            @arg TIM_TS_ITR2: Internal Trigger 2
 *            @arg TIM_TS_ITR3: Internal Trigger 3
 * @retval None
 */
void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_INTERNAL_TRIGGER_SELECTION(TIM_InputTriggerSource));

