ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
}

/**
 * @brief  Selects the TIMx Trigger Output Mode.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 6, 7 or 8 to select the TIM peripheral.
 *     
 * @param  TIM_TRGOSource: specifies the Trigger Output source.
 *   This parameter can be one of the following values:
 *
 *  - For all TIMx
 *            @arg TIM_TRGOSource_Reset:  The UG bit in the TIM_EGR register is used as the trigger output(TRGO)
 *            @arg TIM_TRGOSource_Enable: The Counter Enable CEN is used as the trigger output(TRGO)
 *            @arg TIM_TRGOSource_Update: The update event is selected as the trigger output(TRGO)
 *
 *  - For all TIMx except TIM6 and TIM7
 *            @arg TIM_TRGOSource_OC1: The trigger output sends a positive pulse when the CC1IF flag
 *                                     is to be set, as soon as a capture or compare match occurs(TRGO)
 *            @arg TIM_TRGOSource_OC1Ref: OC1REF signal is used as the trigger output(TRGO)
 *            @arg TIM_TRGOSource_OC2Ref: OC2REF signal is used as the trigger output(TRGO)
 *            @arg TIM_TRGOSource_OC3Ref: OC3REF signal is used as the trigger output(TRGO)
 *            @arg TIM_TRGOSource_OC4Ref: OC4REF signal is used as the trigger output(TRGO)
 *
 * @retval None
 */
void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST5_PERIPH(TIMx));
    assert_param(IS_TIM_TRGO_SOURCE(TIM_TRGOSource));

    /* Reset the MMS Bits */
    TIMx->CR2 &= (uint16_t) ~TIM_CR2_MMS;
    /* Select the TRGO source */
    TIMx->CR2 |= TIM_TRGOSource;
}

/**
 * @brief  Selects the TIMx Slave Mode.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM peripheral.
 * @param  TIM_SlaveMode: specifies the Timer Slave Mode.
 *          This parameter can be one of the following values:
 *            @arg TIM_SlaveMode_Reset: Rising edge of the selected trigger signal(TRGI) reinitialize 
 *                                      the counter and triggers an update of the registers
 *            @arg TIM_SlaveMode_Gated:     The counter clock is enabled when the trigger signal (TRGI) is high
 *            @arg TIM_SlaveMode_Trigger:   The counter starts at a rising edge of the trigger TRGI
 *            @arg TIM_SlaveMode_External1: Rising edges of the selected trigger (TRGI) clock the counter
 * @retval None
 */
void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_SLAVE_MODE(TIM_SlaveMode));

    /* Reset the SMS Bits */
    TIMx->SMCR &= (uint16_t) ~TIM_SMCR_SMS;

    /* Select the Slave Mode */
    TIMx->SMCR |= TIM_SlaveMode;
}

/**
 * @brief  Sets or Resets the TIMx Master/Slave Mode.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM peripheral.
 * @param  TIM_MasterSlaveMode: specifies the Timer Master Slave Mode.
 *          This parameter can be one of the following values:
 *            @arg TIM_MasterSlaveMode_Enable: synchronization between the current timer
 *                                             and its slaves (through TRGO)
 *            @arg TIM_MasterSlaveMode_Disable: No action
 * @retval None
 */
void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_MSM_STATE(TIM_MasterSlaveMode));

    /* Reset the MSM Bit */
    TIMx->SMCR &= (uint16_t) ~TIM_SMCR_MSM;

    /* Set or Reset the MSM Bit */
    TIMx->SMCR |= TIM_MasterSlaveMode;
}

/**
 * @brief  Configures the TIMx External Trigger (ETR).
 * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
 * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
 *          This parameter can be one of the following values:
 *            @arg TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
 *            @arg TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
 *            @arg TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
 *            @arg TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
 * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
 *          This parameter can be one of the following values:
 *            @arg TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
 *            @arg TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
 * @param  ExtTRGFilter: External Trigger Filter.
 *          This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler,
        uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter) {
    uint16_t tmpsmcr = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST3_PERIPH(TIMx));
    assert_param(IS_TIM_EXT_PRESCALER(TIM_ExtTRGPrescaler));
    assert_param(IS_TIM_EXT_POLARITY(TIM_ExtTRGPolarity));
    assert_param(IS_TIM_EXT_FILTER(ExtTRGFilter));

    tmpsmcr = TIMx->SMCR;

    /* Reset the ETR Bits */
    tmpsmcr &= SMCR_ETR_MASK;

    /* Set the Prescaler, the Filter value and the Polarity */
    tmpsmcr |= (uint16_t) (TIM_ExtTRGPrescaler | (uint16_t) (TIM_ExtTRGPolarity | (uint16_t) (ExtTRGFilter << (uint16_t) 8)));

    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
}
/**
 * @}
 */

/** @defgroup TIM_Group8 Specific interface management functions
 *  @brief    Specific interface management functions 
 *
@verbatim   
 ===============================================================================
                    Specific interface management functions
 ===============================================================================  

@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIMx Encoder Interface.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_EncoderMode: specifies the TIMx Encoder Mode.
 *          This parameter can be one of the following values:
 *            @arg TIM_EncoderMode_TI1: Counter counts on TI1FP1 edge depending on TI2FP2 level.
 *            @arg TIM_EncoderMode_TI2: Counter counts on TI2FP2 edge depending on TI1FP1 level.
 *            @arg TIM_EncoderMode_TI12: Counter counts on both TI1FP1 and TI2FP2 edges depending
 *                                       on the level of the other input.
 * @param  TIM_IC1Polarity: specifies the IC1 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_ICPolarity_Falling: IC Falling edge.
 *            @arg TIM_ICPolarity_Rising: IC Rising edge.
 * @param  TIM_IC2Polarity: specifies the IC2 Polarity
 *          This parameter can be one of the following values:
 *            @arg TIM_ICPolarity_Falling: IC Falling edge.
 *            @arg TIM_ICPolarity_Rising: IC Rising edge.
 * @retval None
 */
void TIM_EncoderInterfaceConfig(TIM_TypeDef* TIMx, uint16_t TIM_EncoderMode,
        uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity) {
    uint16_t tmpsmcr = 0;
    uint16_t tmpccmr1 = 0;
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_TIM_ENCODER_MODE(TIM_EncoderMode));
    assert_param(IS_TIM_IC_POLARITY(TIM_IC1Polarity));
    assert_param(IS_TIM_IC_POLARITY(TIM_IC2Polarity));

    /* Get the TIMx SMCR register value */
    tmpsmcr = TIMx->SMCR;

    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Set the encoder Mode */
    tmpsmcr &= (uint16_t) ~TIM_SMCR_SMS;
    tmpsmcr |= TIM_EncoderMode;

