ICinar/autebest_car/src/demos/car/app1/stm32f4xx_tim_bsp.c
    /* Select the Capture Compare 1 and the Capture Compare 2 as input */
    tmpccmr1 &= ((uint16_t) ~TIM_CCMR1_CC1S) & ((uint16_t) ~TIM_CCMR1_CC2S);
    tmpccmr1 |= TIM_CCMR1_CC1S_0 | TIM_CCMR1_CC2S_0;

    /* Set the TI1 and the TI2 Polarities */
    tmpccer &= ((uint16_t) ~TIM_CCER_CC1P) & ((uint16_t) ~TIM_CCER_CC2P);
    tmpccer |= (uint16_t) (TIM_IC1Polarity | (uint16_t) (TIM_IC2Polarity << (uint16_t) 4));

    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Enables or disables the TIMx's Hall sensor interface.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  NewState: new state of the TIMx Hall sensor interface.
 *          This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_SelectHallSensor(TIM_TypeDef* TIMx, FunctionalState NewState) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST2_PERIPH(TIMx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        /* Set the TI1S Bit */
        TIMx->CR2 |= TIM_CR2_TI1S;
    } else {
        /* Reset the TI1S Bit */
        TIMx->CR2 &= (uint16_t) ~TIM_CR2_TI1S;
    }
}
/**
 * @}
 */

/** @defgroup TIM_Group9 Specific remapping management function
 *  @brief   Specific remapping management function
 *
@verbatim   
 ===============================================================================
                     Specific remapping management function
 ===============================================================================  

@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIM2, TIM5 and TIM11 Remapping input capabilities.
 * @param  TIMx: where x can be 2, 5 or 11 to select the TIM peripheral.
 * @param  TIM_Remap: specifies the TIM input remapping source.
 *          This parameter can be one of the following values:
 *            @arg TIM2_TIM8_TRGO: TIM2 ITR1 input is connected to TIM8 Trigger output(default)
 *            @arg TIM2_ETH_PTP:   TIM2 ITR1 input is connected to ETH PTP trogger output.
 *            @arg TIM2_USBFS_SOF: TIM2 ITR1 input is connected to USB FS SOF. 
 *            @arg TIM2_USBHS_SOF: TIM2 ITR1 input is connected to USB HS SOF. 
 *            @arg TIM5_GPIO:      TIM5 CH4 input is connected to dedicated Timer pin(default)
 *            @arg TIM5_LSI:       TIM5 CH4 input is connected to LSI clock.
 *            @arg TIM5_LSE:       TIM5 CH4 input is connected to LSE clock.
 *            @arg TIM5_RTC:       TIM5 CH4 input is connected to RTC Output event.
 *            @arg TIM11_GPIO:     TIM11 CH4 input is connected to dedicated Timer pin(default) 
 *            @arg TIM11_HSE:      TIM11 CH4 input is connected to HSE_RTC clock
 *                                 (HSE divided by a programmable prescaler)  
 * @retval None
 */
void TIM_RemapConfig(TIM_TypeDef* TIMx, uint16_t TIM_Remap) {
    /* Check the parameters */
    assert_param(IS_TIM_LIST6_PERIPH(TIMx));
    assert_param(IS_TIM_REMAP(TIM_Remap));

    /* Set the Timer remapping configuration */
    TIMx->OR = TIM_Remap;
}
/**
 * @}
 */

/**
 * @brief  Configure the TI1 as Input.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9, 10, 11, 12, 13 or 14 
 *         to select the TIM peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *          This parameter can be one of the following values:
 *            @arg TIM_ICPolarity_Rising
 *            @arg TIM_ICPolarity_Falling
 *            @arg TIM_ICPolarity_BothEdge  
 * @param  TIM_ICSelection: specifies the input to be used.
 *          This parameter can be one of the following values:
 *            @arg TIM_ICSelection_DirectTI: TIM Input 1 is selected to be connected to IC1.
 *            @arg TIM_ICSelection_IndirectTI: TIM Input 1 is selected to be connected to IC2.
 *            @arg TIM_ICSelection_TRC: TIM Input 1 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *          This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI1_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
        uint16_t TIM_ICFilter) {
    uint16_t tmpccmr1 = 0, tmpccer = 0;

    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC1E;
    tmpccmr1 = TIMx->CCMR1;
    tmpccer = TIMx->CCER;

    /* Select the Input and set the filter */
    tmpccmr1 &= ((uint16_t) ~TIM_CCMR1_CC1S) & ((uint16_t) ~TIM_CCMR1_IC1F);
    tmpccmr1 |= (uint16_t) (TIM_ICSelection | (uint16_t) (TIM_ICFilter << (uint16_t) 4));

    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= (uint16_t) ~(TIM_CCER_CC1P | TIM_CCER_CC1NP);
    tmpccer |= (uint16_t) (TIM_ICPolarity | (uint16_t) TIM_CCER_CC1E);

    /* Write to TIMx CCMR1 and CCER registers */
    TIMx->CCMR1 = tmpccmr1;
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configure the TI2 as Input.
 * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
 *         peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *          This parameter can be one of the following values:
 *            @arg TIM_ICPolarity_Rising
 *            @arg TIM_ICPolarity_Falling
 *            @arg TIM_ICPolarity_BothEdge   
 * @param  TIM_ICSelection: specifies the input to be used.
 *          This parameter can be one of the following values:
 *            @arg TIM_ICSelection_DirectTI: TIM Input 2 is selected to be connected to IC2.
 *            @arg TIM_ICSelection_IndirectTI: TIM Input 2 is selected to be connected to IC1.
 *            @arg TIM_ICSelection_TRC: TIM Input 2 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *          This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI2_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
        uint16_t TIM_ICFilter) {
    uint16_t tmpccmr1 = 0, tmpccer = 0, tmp = 0;

    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= (uint16_t) ~TIM_CCER_CC2E;
    tmpccmr1 = TIMx->CCMR1;
    tmpccer = TIMx->CCER;
    tmp = (uint16_t) (TIM_ICPolarity << 4);

